Revit 2027 API
EmbodiedCarbonAsset.CategoryName Property
 User visible name of category. List of available categories can be retrieved from Sustainability API.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CategoryName { get; }
Public ReadOnly Property CategoryName As String
	Get
public:
property String^ CategoryName {
	String^ get ();
}
member CategoryName : string with get
Property Value
String
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace